FemDesign.Results.FeaShell
FemDesign "Shell" result

FemDesign.Results.FeaShell.Id
Shell name identifier

FemDesign.Results.FeaShell.ElementId
Shell Element Index

FemDesign.Results.FeaShell.Node1
Shell Connectivity
Node i-1

FemDesign.Results.FeaShell.Node2
Shell Connectivity
Node i-2

FemDesign.Results.FeaShell.Node3
Shell Connectivity
Node i-3

FemDesign.Results.FeaShell.Node4
Shell Connectivity
Node i-4

FemDesign.Results.FeaShell.DeconstructFeaShell(System.Collections.Generic.List{FemDesign.Results.FeaShell})
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.